Exercise - 01

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Name": ["Aman", "Saurav", "Karan", "shubham", "Abhishek", None, "sameer"],
    "Age": [22, 23, None, 22, 25, 24, 26],
    "Marks": [85, None, 88, 90, 56, 72, None],
    "Subject": ["Math", "Physics", "Math", "Chemistry", "Math", "Physics", "Chemistry"]
})

df

       Name   Age  Marks    Subject
0      Aman  22.0   85.0       Math
1    Saurav  23.0    NaN    Physics
2     Karan   NaN   88.0       Math
3   shubham  22.0   90.0  Chemistry
4  Abhishek  25.0   56.0       Math
5      None  24.0   72.0    Physics
6    sameer  26.0    NaN  Chemistry

Shape of dataframe

In [3]:
print(df.shape)

(7, 4)

Datatypes of dataframe

In [4]:
print(df.dtypes)

Name        object
Age        float64
Marks      float64
Subject     object
dtype: object

In [7]:
print(df.describe)

# print(df.mean)
# print(df.min)
# print(df.max)

<bound method NDFrame.describe of        Name   Age  Marks    Subject
0      Aman  22.0   85.0       Math
1    Saurav  23.0    NaN    Physics
2     Karan   NaN   88.0       Math
3   shubham  22.0   90.0  Chemistry
4  Abhishek  25.0   56.0       Math
5      None  24.0   72.0    Physics
6    sameer  26.0    NaN  Chemistry>